Revit 2027 API
DirectShapeType.RemoveReferenceObject(String) Method
 Removes any reference objects with the given name from the DirectShapeType. Nothing is done if no reference objects have the given name or if the name is the empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveReferenceObject(
	string refName
)
Public Sub RemoveReferenceObject (
	refName As String
)
public:
void RemoveReferenceObject(
	String^ refName
)
member RemoveReferenceObject :
        refName : string -> unit
Parameters
refName String
 The name of the reference object(s) to be removed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
RemoveReferenceObject Overload
Autodesk.Revit.DB Namespace